{
  "profile": {
    "name": "Mohamad Syazwan B Ahmad Zubir",
    "phone": "+60 19 884 0908",
    "email": "mohamadsyazwan.az@gmail.com",
    "url": "https://syazwan.xyz",
    "location": "Selangor, Malaysia"
  },
  "introduction": {
    "title": "Software Engineer / Front End Developer",
    "summary": "As a software engineer, I bring a unique background in chemical engineering, where I worked for 6 years before transitioning to software development in 2020. I have attended courses and bootcamp to enhance my skills, with a focus on Frontend development. I am also committed to continuing my learning journey and expanding my knowledge to become a full stack engineer. I am open to learn new tech stacks and always eager to take on challenging assignments that push me to develop new skills."
  },
  "skills": [
    {
      "id": 1,
      "category": "Frontend",
      "list": [
        "HTML",
        "CSS",
        "JavaScript",
        "React",
        "Next.js",
        "Tailwind CSS",
        "Material UI",
        "React Native",
        "Expo"
      ]
    },
    {
      "id": 2,
      "category": "Backend",
      "list": ["Node.js", "Express.js"]
    },
    {
      "id": 3,
      "category": "Database",
      "list": ["MySQL", "MongoDB"]
    },
    {
      "id": 4,
      "category": "Other",
      "list": [
        "Cloudflare",
        "GitHub",
        "AWS (S3, SES, SQS, Lambda, Amplify, etc.)",
        "Bugsnag"
      ]
    }
  ],
  "experience": [
    {
      "id": 1,
      "company": "INVOKE Solutions Sdn Bhd",
      "location": "Kuala Lumpur",
      "title": "Software Engineer",
      "startDate": "June 2020",
      "endDate": "Present",
      "details": [
        "<ul><li><strong>Leadership and Project Coordination:</strong> Led the development of both internal products and client-specific projects, working closely with product managers and UI/UX designers to deliver functional solutions on schedule.</li><li><strong>In-House Product Development:</strong><ul><li><strong>ADNEXIO:</strong> Served as a key member of the development team for ADNEXIO, a comprehensive job platform. Focused primarily on frontend development, while also contributing to API development and deployment to support team goals.</li></ul></li><li><strong>Project Contributions:</strong><ul><li><strong>Ayuh Malaysia:</strong> Developed a full-stack web application using React for the front-end and Node.js with Express.js for back-end services, handling features such as payment systems (eGHL), contact support, and volunteer registration.</li><li><strong>INVOKE Official Website:</strong> Developed and maintained the official website for INVOKE, using Next.js and Tailwind CSS for the front-end, and leveraging AWS SES for email services and Vercel for hosting.</li><li><strong>CISTA:</strong> A mobile application to facilitate volunteer activities related to Malaysia's elections, developed using React Native and Expo.</li><li><strong>Client Project (Confidential):</strong> Coordinated the full lifecycle of a client project, including API development with Node.js and MongoDB, and incorporated MinIO for object storage solutions. Set up a comprehensive deployment on an Ubuntu server using tools like Nginx and PM2 for stable performance.</li></ul></li></ul>"
      ]
    },
    {
      "id": 2,
      "company": "Amgen Singapore Manufacturing",
      "location": "Singapore",
      "title": "Process Engineer",
      "startDate": "Sep 2016",
      "endDate": "Aug 2019",
      "details": [
        "<ul><li>Compiled and analyzed process data from various sources (OSIsoft PI, PAS-X MES, LIMS) for ongoing cGMP production of commercial protein biologics processes.</li><li>Developed Microsoft Excel macros program using VBA and Python to automate and expedite repeated tasks such as creating batch summary report, raw material tracking and data wrangling.</li></ul>"
      ]
    },
    {
      "id": 3,
      "company": "Biocon Sdn Bhd",
      "location": "Johor, Malaysia",
      "title": "Senior Associate",
      "startDate": "Sep 2013",
      "endDate": "Aug 2016",
      "details": [
        "<ul><li>Executed the commissioning of a greenfield Insulin manufacturing plant, overseeing the integration of bioreactors and Emerson's DeltaV process control system.</li><li>Operated the plant to produce both validation and commercial batches of Insulin by closely monitored and controlled the process through the DCS system.</li></ul>"
      ]
    },
    {
      "id": 4,
      "company": "PETRONAS Fertilizer Kedah",
      "location": "Kedah, Malaysia",
      "title": "Intern",
      "startDate": "Jun 2010",
      "endDate": "Jan 2011",
      "details": [
        "<ul><li>Assisted engineers and management with technical and clerical duties, including updating P&ID, documenting daily reports, data analysis and organizing presentations.</li><li>Participated in several technical projects such as CO2 compressor performance study and Urea granulation wet cleaning activities.</li></ul>"
      ]
    }
  ],
  "education": [
    {
      "id": 1,
      "institution": "Universiti Sains Malaysia",
      "degree": "MSc. in Chemical Engineering",
      "startYear": "2012",
      "endYear": "2013"
    },
    {
      "id": 2,
      "institution": "Universiti Teknologi PETRONAS",
      "degree": "Bachelor of Engineering (Hons.) Chemical",
      "startYear": "2008",
      "endYear": "2012"
    }
  ],
  "courses": [
    {
      "id": 1,
      "name": "Full Stack Bootcamp",
      "providerName": "getCTO",
      "providerUrl": "https://getcto.asia",
      "startDate": "Jun 2020",
      "endDate": "Aug 2020"
    },
    {
      "id": 2,
      "name": "Data Science 360 Certification Program",
      "providerName": "LEAD",
      "providerUrl": "https://thelead.io",
      "startDate": "Jul 2019",
      "endDate": "Jul 2019"
    }
  ]
}
